app/controllers/home_controller.rb

SELECT * FROM "users" WHERE ("users"."id" = 3) LIMIT 1
---
  def dashboard
    if not session[:user_id]
      redirect_to :controller => :home, :action => :index
    end

    @user = User.find(session[:user_id])