app/controllers/oauth_controller.rb

  def access_token
    request_token = OAuth::RequestToken.new($sc_consumer, session[:request_token], session[:request_token_secret])
    access_token = request_token.get_access_token(:oauth_verifier => params[:oauth_verifier])

    sc = Soundcloud.register({:access_token => access_token, :site => "http://api.#{$sc_host}"})
    me = sc.User.find_me
    sc_account = SoundcloudAccount.create :username => me.username, :oauth_token => access_token.token, :oauth_token_secret => access_token.secret
---
SELECT * FROM "users" WHERE ("users"."id" IS NULL) LIMIT 1
INSERT INTO "soundcloud_accounts" ("oauth_token_secret", "created_at", "updated_at", "username", "oauth_token") VALUES('YbsLQMqCFZTd5LZtaafvNZfrYnbADf7y4FmgKCZANQo', '2009-08-20 13:28:01', '2009-08-20 13:28:01', 'jwagener2', 'MwfpOprDsrunZgk2vmTwQ')