app/controllers/user_controller.rb

  def create
    @user = User.new(params[:user])

    if @user.save
---
INSERT INTO "users" ("name", "salt", "created_at", "sc_user_id", "updated_at", "hashed_password", "sc_access_token_secret", "sc_access_token", "soundcloud_account_id") VALUES('jw', '193135600.089306556540245', '2009-08-20 13:57:21', NULL, '2009-08-20 13:57:21', 'bcbb77728904527740144544830bfd4771984684', NULL, NULL, 13)

  def profile
    @user = User.find(params[:id])
---
SELECT * FROM "users" WHERE ("users"."id" IS NULL) LIMIT 1

  def settings
    if Integer(session[:user_id]) != Integer(params[:id])
      flash[:notice] = "You're not allowed to see other members' settings!"
      redirect_to(:action => 'settings', :id => session[:user_id])
    else
      @user = User.find(session[:user_id])
---
SELECT * FROM "users" WHERE ("users"."id" = 3) LIMIT 1